schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    x_ps_free(&_settings.lastconnectedhost);
    x_ps_free(&_settings.lastconnectedfile);

    _cur_volume                 = atoi(   parseJson("\"volume\":"));
    _volumeSteps                = atoi(   parseJson("\"volumeSteps\":"));
    _ringVolume                 = atoi(   parseJson("\"ringVolume\":"));
    _volumeAfterAlarm           = atoi(   parseJson("\"volumeAfterAlarm\":"));
    _BTvolume                   = atoi(   parseJson("\"BTvolume\":"));
    _f_BTpower                  = (strcmp(parseJson("\"BTpower\":"), "true") == 0) ? 1 : 0;
    _btEmitterMode              = ((strcmp(parseJson("\"BTmode\":"), "TX") == 0) ? "TX" : "RX");
    _alarmtime[0]               = computeMinuteOfTheDay(parseJson("\"alarmtime_sun\":"));
    _alarmtime[1]               = computeMinuteOfTheDay(parseJson("\"alarmtime_mon\":"));
    _alarmtime[2]               = computeMinuteOfTheDay(parseJson("\"alarmtime_tue\":"));
    _alarmtime[3]               = computeMinuteOfTheDay(parseJson("\"alarmtime_wed\":"));
    _alarmtime[4]               = computeMinuteOfTheDay(parseJson("\"alarmtime_thu\":"));
    _alarmtime[5]               = computeMinuteOfTheDay(parseJson("\"alarmtime_fri\":"));
    _alarmtime[6]               = computeMinuteOfTheDay(parseJson("\"alarmtime_sat\":"));
    _alarmdays                  = atoi(       parseJson("\"alarm_weekdays\":"));
    _f_timeAnnouncement         = (strcmp(    parseJson("\"timeAnnouncing\":"), "true") == 0) ? 1 : 0;
    strcpy(_timeSpeechLang,                   parseJson("\"timeSpeechLang\":"));
    _f_mute                     = (strcmp(    parseJson("\"mute\":"), "true") == 0) ? 1 : 0;
    _brightness                 = atoi(       parseJson("\"brightness\":"));
    _sleeptime                  = atoi(       parseJson("\"sleeptime\":"));
    _cur_station                = atoi(       parseJson("\"station\":"));
    _toneLP                     = atoi(       parseJson("\"toneLP\":"));
    _toneBP                     = atoi(       parseJson("\"toneBP\":"));
    _toneHP                     = atoi(       parseJson("\"toneHP\":"));
    _toneBAL                    = atoi(       parseJson("\"balance\":"));
    _timeFormat                 = atoi(       parseJson("\"timeFormat\":"));
    _TZName                     =             parseJson("\"Timezone_Name\":");
    _TZString                   =             parseJson("\"Timezone_String\":");
    _settings.lastconnectedhost = x_ps_strdup(parseJson("\"lastconnectedhost\":"));
    _settings.lastconnectedfile = x_ps_strdup(parseJson("\"lastconnectedfile\":"));
    _sleepMode                  = atoi(       parseJson("\"sleepMode\":"));
    _state                      = atoi(       parseJson("\"state\":"));

    // set some items ---------------------------------------------------------------------------------------------
    if(!startsWith(_settings.lastconnectedfile, "/")) {x_ps_free(&_settings.lastconnectedfile); _settings.lastconnectedfile = x_ps_strdup("/audiofiles/");} // guard
    _SD_content.setLastConnectedFile(_settings.lastconnectedfile);
    x_ps_free(&_cur_AudioFolder); _cur_AudioFolder = x_ps_strdup(_SD_content.getLastConnectedFolder());
    x_ps_free(&_cur_AudioFileName); _cur_AudioFileName = x_ps_strdup(_SD_content.getLastConnectedFileName());
    _cur_AudioFileNr = _SD_content.getPosByFileName(_cur_AudioFileName);
    // ------------------------------------------------------------------------------------------------------------
    x_ps_free(&jO);
    x_ps_free(&tmp);

    if(!SD_MMC.exists("/stations.json")){  // if not found create one
        File file1 = SD_MMC.open("/stations.json","w", true);
        file1.write((uint8_t*)stations_json, sizeof(stations_json) -1); // without termination
        file1.close();
    }
    staMgnt.updateStationsList();
    return true;
}
// clang-format on

// clang-format off
void updateSettings(){
    if(!_settings.lastconnectedhost) _settings.lastconnectedhost= strdup("");
    if(!_settings.lastconnectedfile) _settings.lastconnectedfile= strdup("/audiofiles/");
    char*  jO = x_ps_malloc(2048 + strlen(_settings.lastconnectedhost)); // JSON Object
    char tmp[40 + strlen(_settings.lastconnectedhost)];
    strcpy(jO,   "{\n");
    sprintf(tmp, "  \"volume\":%i", _cur_volume);                                                   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"volumeSteps\":%i", _volumeSteps);                                          strcat(jO, tmp);
    sprintf(tmp, ",\n  \"ringVolume\":%i", _ringVolume);                                            strcat(jO, tmp);
    sprintf(tmp, ",\n  \"volumeAfterAlarm\":%i", _volumeAfterAlarm);                                strcat(jO, tmp);
    sprintf(tmp, ",\n  \"BTvolume\":%i", _BTvolume);                                                strcat(jO, tmp);
    strcat(jO,   ",\n  \"BTpower\":"); (_f_BTpower == true) ?                                       strcat(jO, "\"true\"") : strcat(jO, "\"false\"");
    sprintf(tmp, ",\n  \"BTmode\":\"%s\"", bt_emitter.getMode());                                   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarmtime_sun\":\"%02d:%02d\"", _alarmtime[0] / 60, _alarmtime[0] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarmtime_mon\":\"%02d:%02d\"", _alarmtime[1] / 60, _alarmtime[1] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarmtime_tue\":\"%02d:%02d\"", _alarmtime[2] / 60, _alarmtime[2] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarmtime_wed\":\"%02d:%02d\"", _alarmtime[3] / 60, _alarmtime[3] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarmtime_thu\":\"%02d:%02d\"", _alarmtime[4] / 60, _alarmtime[4] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarmtime_fri\":\"%02d:%02d\"", _alarmtime[5] / 60, _alarmtime[5] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarmtime_sat\":\"%02d:%02d\"", _alarmtime[6] / 60, _alarmtime[6] % 60);   strcat(jO, tmp);
    sprintf(tmp, ",\n  \"alarm_weekdays\":%i", _alarmdays);                                         strcat(jO, tmp);
    strcat(jO,   ",\n  \"timeAnnouncing\":"); (_f_timeAnnouncement == true) ?                       strcat(jO, "\"true\"") : strcat(jO, "\"false\"");
    sprintf(tmp, ",\n  \"timeSpeechLang\":\"%s\"", _timeSpeechLang);                                strcat(jO, tmp);
    strcat(jO,   ",\n  \"mute\":");           (_f_mute == true)             ?                       strcat(jO, "\"true\"") : strcat(jO, "\"false\"");
    sprintf(tmp, ",\n  \"brightness\":%i", _brightness);                                            strcat(jO, tmp);
    sprintf(tmp, ",\n  \"sleeptime\":%i", _sleeptime);                                              strcat(jO, tmp);
    sprintf(tmp, ",\n  \"lastconnectedhost\":\"%s\"", _settings.lastconnectedhost);                 strcat(jO, tmp);
    sprintf(tmp, ",\n  \"lastconnectedfile\":\"%s\"", _settings.lastconnectedfile);                 strcat(jO, tmp);
    sprintf(tmp, ",\n  \"station\":%i", _cur_station);                                              strcat(jO, tmp);
    sprintf(tmp, ",\n  \"Timezone_Name\":\"%s\"", _TZName.c_str());                                 strcat(jO, tmp);
    sprintf(tmp, ",\n  \"Timezone_String\":\"%s\"", _TZString.c_str());                             strcat(jO, tmp);
    sprintf(tmp, ",\n  \"toneLP\":%i", _toneLP);                                                    strcat(jO, tmp);
    sprintf(tmp, ",\n  \"toneBP\":%i", _toneBP);                                                    strcat(jO, tmp);
    sprintf(tmp, ",\n  \"toneHP\":%i", _toneHP);                                                    strcat(jO, tmp);
    sprintf(tmp, ",\n  \"balance\":%i", _toneBAL);                                                  strcat(jO, tmp);
    sprintf(tmp, ",\n  \"timeFormat\":%i", _timeFormat);                                            strcat(jO, tmp);
    sprintf(tmp, ",\n  \"state\":%i", _state);                                                      strcat(jO, tmp);
    sprintf(tmp, ",\n  \"sleepMode\":%i\n}", _sleepMode);                                           strcat(jO, tmp);

    if(_settingsHash != simpleHash(jO)) {
        File file = SD_MMC.open("/settings.json", "w", false);
        if(!file) {
            log_e("file \"settings.json\" not found");
            return;
        }
        file.print(jO);
        _settingsHash = simpleHash(jO);
    }
    x_ps_free(&jO);
}
// clang-format on

