schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
    if(I2C_SCL != -1){
        _f_BH1750_found = BH1750.begin(BH1750.ADDR_TO_GROUND , I2C_SDA, I2C_SCL);// init the sensor with address pin connetcted to ground
    }
    if (_f_BH1750_found) {                                                  // result (bool) wil be be "false" if no sensor found
        SerialPrintfln("setup: ....  " ANSI_ESC_WHITE "Ambient Light Sensor BH1750 found");
        BH1750.setResolutionMode(BH1750.ONE_TIME_H_RESOLUTION_MODE);
        BH1750.setSensitivity(BH1750.SENSITIVITY_ADJ_MAX);
    }
    bt_emitter.begin();
}
/*****************************************************************************************************************************************************
 *                                                                   C O M M O N                                                                     *
 *****************************************************************************************************************************************************/

const char* scaleImage(const char* path) {
    if((!endsWith(path, "bmp")) && (!endsWith(path, "jpg")) && (!endsWith(path, "gif") &&(!endsWith(path, "png")))) { // not a image
        return path;
    }
    if(startsWith(path, "/png")) return path; // nothing to do, icons for website
    static char pathBuff[256];
    memset(pathBuff, 0, sizeof(pathBuff));
    int idx = indexOf(path, "/", 1);
    if(idx < 0) return path; // invalid path
    else {
        strncpy(pathBuff, path, idx + 1);
        strcat(pathBuff, _prefix);
        strcat(pathBuff, path + idx + 1);
    }
    return pathBuff;
}

void setVolume(uint8_t vol) {
    static int16_t oldVol = -1;
    log_i("vol %i   oldVol %i", vol, oldVol);
    if(vol == oldVol) return;
    _cur_volume = vol;
    oldVol = vol;
    dispHeader.updateVolume(_cur_volume);
    sdr_CL_volume.setValue(_cur_volume);
    sdr_DL_volume.setValue(_cur_volume);
    sdr_PL_volume.setValue(_cur_volume);
    sdr_RA_volume.setValue(_cur_volume);
    SerialPrintfln("action: ...  current volume is " ANSI_ESC_CYAN "%d", _cur_volume);

#if DECODER > 1 // ES8388, AC101 ...
    uint8_t v = map_l(_cur_volume, 0, _volumeSteps, 0, 63);
    if(HP_DETECT == -1) {
        if(_f_mute){
            dac.SetVolumeSpeaker(0);
            dac.SetVolumeHeadphone(0);
        }
        else{
            dac.SetVolumeSpeaker(v);
            dac.SetVolumeHeadphone(v);
        }
    }
    else {
        if(_f_mute){
            dac.SetVolumeSpeaker(0);
            dac.SetVolumeHeadphone(0);
        }
        else{
            if(digitalRead(HP_DETECT) == HIGH) {
                // SerialPrintfln("HP_Detect = High, volume %i", vol);
                dac.SetVolumeSpeaker(v);
                dac.SetVolumeHeadphone(0);
            }
            else {
                // SerialPrintfln("HP_Detect = Low, volume %i", vol);
                dac.SetVolumeSpeaker(0);
                dac.SetVolumeHeadphone(v);
            }
        }
    }
#endif
}

uint8_t downvolume() {
    uint8_t steps = _volumeSteps / 20;
    if(_cur_volume == 0) return _cur_volume;
    else if (steps < _cur_volume) _cur_volume -= steps;
    else _cur_volume --;
    sdr_CL_volume.setValue(_cur_volume);
    sdr_DL_volume.setValue(_cur_volume);
    sdr_PL_volume.setValue(_cur_volume);
    sdr_RA_volume.setValue(_cur_volume);
    _f_mute = false;
    muteChanged(_f_mute); // set mute off
    return _cur_volume;
}

uint8_t upvolume() {
    uint8_t steps = _volumeSteps / 20;
    if(_cur_volume == _volumeSteps) return _cur_volume;
    else if (_volumeSteps > _cur_volume + steps) _cur_volume += steps;
    else  _cur_volume ++;
    sdr_CL_volume.setValue(_cur_volume);
    sdr_DL_volume.setValue(_cur_volume);
    sdr_PL_volume.setValue(_cur_volume);
    sdr_RA_volume.setValue(_cur_volume);
    _f_mute = false;
    muteChanged(_f_mute); // set mute off
    return _cur_volume;
}

void setStation(uint16_t sta) {
    static uint16_t old_cur_station = 0;
    // SerialPrintfln("sta %d, _cur_station %d", sta, _cur_station );
    if(sta == 0) return;
    if(sta > staMgnt.getSumStations()) sta = _cur_station;
    x_ps_free(&_stationURL);
    _stationURL = x_ps_strdup(staMgnt.getStationUrl(sta));
    _homepage = "";
    SerialPrintfln("action: ...  switch to station " ANSI_ESC_CYAN "%d", sta);

    if(_f_isWebConnected && sta == old_cur_station && _state == RADIO) { // Station is already selected
        _f_newStreamTitle = true;
    }
    else {
        if(_state != RADIO) {_radioSubMenue = 0; changeState(RADIO);}
        _streamTitle[0] = '\0';
        _icyDescription[0] = '\0';
        _f_newStreamTitle = true;
        _f_newIcyDescription = true;
        connecttohost(_stationURL);
    //    if(!_f_isWebConnected) _cur_station = old_cur_station; // host is not connected
    }
    old_cur_station = sta;
    StationsItems();
    if(_state == RADIO) {
        showLogoAndStationName(true);
        if(_cur_station == 0){
            dispFooter.updateFlag(NULL);
        }
        else{
            char path[25] ="/flags/";
            strcat(path, staMgnt.getStationCountry(_cur_station));
            for(int i = 0; i< strlen(path); i++) path[i] = tolower(path[i]);
            strcat(path, ".jpg");
            const char* scaledpath = scaleImage(path);
            dispFooter.updateFlag(scaledpath);
        }
    }
    dispFooter.updateStation(_cur_station);
}
void nextStation() {
    setStation(staMgnt.nextStation());
}
void nextFavStation() {
    setStation(staMgnt.nextFavStation());
}
void prevStation() {
    setStation(staMgnt.prevStation());
}
void prevFavStation() {
    setStation(staMgnt.prevFavStation());
}
void setStationByNumber(uint16_t staNr){
    setStation(staMgnt.setStationByNumber(staNr));
}

void StationsItems() {
    if(!_stationName_air)  _stationName_air = (char*)calloc(1, 1);
    char* stationLogo_air = x_ps_malloc(strlen(_stationName_air) + 15);
    strcpy(stationLogo_air, "/logo/");
    strcat(stationLogo_air, _stationName_air);
    strcat(stationLogo_air, ".jpg");
    char staNr[10]; itoa(_cur_station, staNr, 10);

    if(_cur_station == 0){
        webSrv.send("stationLogo=", stationLogo_air);
        webSrv.send("stationNr=", staNr);
        webSrv.send("stationURL=", _settings.lastconnectedhost);
    }
    else{
        webSrv.send("stationLogo=", "/logo/" + String(staMgnt.getStationName(_cur_station)) + ".jpg");
        webSrv.send("stationNr=", staNr);
        if(_stationURL) webSrv.send("stationURL=", String(_stationURL));
    }
    x_ps_free(&stationLogo_air);
}

