schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
void setStationViaURL(const char* url, const char* extension) {
    // e.g.  http://lstn.lv/bbcradio.m3u8?station=bbc_radio_one&bitrate=96000
    // url is http://lstn.lv/bbcradio.m3u8?station=bbc_radio_one, extension is bitrate=96000
    x_ps_free(&_stationName_air);
    _cur_station = 0;
    x_ps_free(&_stationURL);
    int len_url = strlen(url) + strlen(extension) + 3;
    char* origin_url = (char*)calloc(1, len_url);
    if(strlen(extension) > 0) {
        strcpy(origin_url, url);
        strcat(origin_url, "&");
        strcat(origin_url, extension);
    }
    else { strcpy(origin_url, url); }
    _stationURL = x_ps_strdup(origin_url);
    connecttohost(origin_url);
    StationsItems();
    if(_state == RADIO) {
        clearStreamTitle();
        showLogoAndStationName(true);
    }
    dispFooter.updateStation(0); // set 000
}

void savefile(const char* fileName, uint32_t contentLength) { // save the uploadfile on SD_MMC
    char fn[256];
    _f_SD_Upload = false;
    if(!startsWith(fileName, "/")) {
        strcpy(fn, "/");
        strcat(fn, fileName);
    }
    else { strcpy(fn, fileName); }
    if(webSrv.uploadfile(SD_MMC, fn, contentLength)) {
        SerialPrintfln("save file:   " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD card was successfully", fn);
        webSrv.sendStatus(200);
    }
    else {
        SerialPrintfln("save file:   " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD failed", fn);
        webSrv.sendStatus(400);
    }
}

void saveImage(const char* fileName, uint32_t contentLength) { // save the jpg image on SD_MMC
    char fn[256];

    if(!_f_SD_Upload && endsWith(fileName, "jpg")) {
        strcpy(fn, "/logo/");
        strcat(fn, _prefix);
        if(!startsWith(fileName, "/")) strcat(fn, "/");
        strcat(fn, fileName);
        if(webSrv.uploadB64image(SD_MMC, fn, contentLength)) {
            SerialPrintfln("save image (jpg) " ANSI_ESC_CYAN "%s" ANSI_ESC_WHITE " to SD card was successfully", fn);
            webSrv.sendStatus(200);
        }
        else webSrv.sendStatus(400);
    }
}

String setI2STone() {
    int8_t LP = _toneLP;
    int8_t BP = _toneBP;
    int8_t HP = _toneHP;
    int8_t BAL = _toneBAL;
    audio.setTone(LP, BP, HP);
    audio.setBalance(BAL);
    sprintf(_chbuf, "LowPass=%i\nBandPass=%i\nHighPass=%i\nBalance=%i\n", LP, BP, HP, BAL);
    String tone = String(_chbuf);
    return tone;
}

void SD_playFile(const char* pathWoFileName, const char* fileName) { // pathWithoutFileName e.g. /audiofiles/playlist/
log_e("SD_playFile: %s%s", pathWoFileName, fileName);
    sprintf(_chbuf, "%s%s", pathWoFileName, fileName);
log_e("SD_playFile: %s", _chbuf);
    int32_t idx = indexOf(_chbuf, "\033[", 1);
    if(idx == -1) { ; }          // do nothing
    else { _chbuf[idx] = '\0'; } // remove color and filesize
    SD_playFile(_chbuf, 0, true);
}

void SD_playFile(const char* path, uint32_t resumeFilePos, bool showFN) {
    if(!path) return;                            // avoid a possible crash
    if(endsWith(path, "ogg")) resumeFilePos = 0; // resume only mp3, m4a, flac and wav
    if(endsWith(path, "m3u")) {
        if(SD_MMC.exists(path)) {
            preparePlaylistFromFile(path);
            processPlaylist(true);
        }
        return;
    }
    if(_playerSubMenue != 1 && _playerSubMenue != 3){
        _playerSubMenue = 1; changeState(PLAYER);
    }
    int32_t idx = lastIndexOf(path, '/');
    if(idx < 0) return;
    x_ps_free(&_cur_AudioFolder); _cur_AudioFolder = strdup(path); _cur_AudioFolder[idx] = '\0';

    if(showFN) {
        clearLogo();
        showFileName(path + idx + 1);
    }

    SerialPrintfln("AUDIO_FILE:  " ANSI_ESC_MAGENTA "%s", path + idx + 1);
    connecttoFS("SD_MMC", (const char*)path, resumeFilePos);
    if(_f_playlistEnabled) showPlsFileNumber();
    if(_f_isFSConnected) {
        x_ps_free(&_settings.lastconnectedfile);
        _settings.lastconnectedfile = x_ps_strdup(path);
    }
}

bool SD_rename(const char* src, const char* dest) {
    bool success = false;
    if(SD_MMC.exists(src)) {
        log_i("exists");
        success = SD_MMC.rename(src, dest);
    }
    return success;
}

bool SD_newFolder(const char* folderPathName) {
    bool success = false;
    success = SD_MMC.mkdir(folderPathName);
    return success;
}

bool SD_delete(const char* itemPath) {
    bool success = false;
    if(SD_MMC.exists(itemPath)) {
        File dirTest = SD_MMC.open(itemPath, "r");
        bool isDir = dirTest.isDirectory();
        dirTest.close();
        if(isDir) success = SD_MMC.rmdir(itemPath);
        else success = SD_MMC.remove(itemPath);
    }
    return success;
}

void headphoneDetect() { // called via interrupt
    _f_hpChanged = true;
}

void fall_asleep() {
    _f_sleeping = true;
    _f_playlistEnabled = false;
    _f_isFSConnected = false;
    _f_isWebConnected = false;
    audio.stopSong();
    if(AMP_ENABLED != -1) {digitalWrite(AMP_ENABLED, LOW);}
    if(_sleepMode == 0){
        clearAll();
        setTFTbrightness(0);
    }
    else{
        _clockSubMenue = 0;
        changeState(CLOCK);
    }
    if(_f_BTpower) BTpowerChanged(false);
    SerialPrintfln("falling asleep");
    dispHeader.hide();
    dispFooter.hide();
}

void wake_up() {
    _f_sleeping = false;
    _f_irOnOff = false;
    SerialPrintfln("awake");
    _f_mute = true;
    muteChanged(false);
    clearAll();
    setTFTbrightness(_brightness);
    if(AMP_ENABLED != -1) {digitalWrite(AMP_ENABLED, HIGH);}
    if(_cur_station) setStation(_cur_station);
    else connecttohost(_settings.lastconnectedhost);
    _radioSubMenue = 0;
    changeState(RADIO);
    showLogoAndStationName(true);
    dispHeader.show();
    dispHeader.speakerOnOff(_f_mute);
    dispHeader.updateRSSI(WiFi.RSSI(), true);
    dispFooter.show();
    if(_f_BTpower) BTpowerChanged(true);
}

void setRTC(const char* TZString) {
    rtc.stop();
    rtc.begin(_TZString.c_str());
    // if(!_f_rtc) {
    //     SerialPrintfln(ANSI_ESC_RED "connection to NTP failed, trying again");
    //     ESP.restart();
    // }
}

boolean copySDtoFFat(const char* path) {
    if(!_f_FFatFound) return false;
    uint8_t buffer[1024];
    size_t  r = 0, w = 0;
    size_t  len = 0;
    File    file1 = SD_MMC.open(path, "r");
    File    file2 = FFat.open(path, "w");
    while(true) {
        r = file1.read(buffer, 1024);
        w = file2.write(buffer, r);
        if(r != w) {
            file1.close();
            file2.close();
            FFat.remove(path);
            return false;
        }
        len += r;
        if(r == 0) break;
    }
    log_i("file length %i, written %i", file1.size(), len);
    if(file1.size() == len) return true;
    return false;
}

void muteChanged(bool m) {
    _f_muteIsPressed = false;
    btn_CL_mute.setValue(m);
    btn_DL_mute.setValue(m);
    btn_EQ_mute.setValue(m);
    btn_PL_mute.setValue(m);
    btn_RA_mute.setValue(m);
    if(m) {_f_mute = true;}
    else  {_f_mute = false;}
    if(m) webSrv.send("mute=", "1");
    else webSrv.send("mute=", "0");
    dispHeader.speakerOnOff(_f_mute);
    dispHeader.updateVolume(_cur_volume);
    updateSettings();
};

void BTpowerChanged(int8_t newState){
    if(BT_EMITTER_CONNECT == -1) return;    // guard
    if(_f_BtEmitterFound == false) return;  // guard

    if(newState){                           // POWER_ON
        digitalWrite(BT_EMITTER_CONNECT, LOW);
        vTaskDelay(100);
        digitalWrite(BT_EMITTER_CONNECT, HIGH);
    }
    else{
        bt_emitter.cmd_PowerOff();          // POWER OFF
    }
    return;
}

void logAlarmItems() {
    const char wd[7][11] = {"Sunday:   ", "Monday:   ", "Tuesday:  ", "Wednesday:", "Thursday: ", "Friday:   ", "Saturday: "};
    uint8_t    mask = 0b00000001;
    for(uint8_t i = 0; i < 7; i++) {
        if(_alarmdays & mask) { SerialPrintfln("AlarmTime:   " ANSI_ESC_YELLOW "%s " ANSI_ESC_CYAN "%02i:%02i", wd[i], _alarmtime[i] / 60, _alarmtime[i] % 60); }
        else { SerialPrintfln("AlarmTime:   " ANSI_ESC_YELLOW "%s No alarm is set", wd[i]); }
        mask <<= 1;
    }
}

void setTimeCounter(uint8_t sec){
    if(sec){
        _timeCounter.timer = 10;
        _timeCounter.factor = sec;
    }
    else{
        _timeCounter.timer = 0;
        _timeCounter.factor = 0;
        dispFooter.updateTC(0);
    }
}


/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                                  M E N U E / B U T T O N S                                                                  ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

// clang-format off
void placingGraphicObjects() { // and initialize them
    // ALL STATE
    dispHeader.begin(         _winHeader.x, _winHeader.y, _winHeader.w, _winHeader.h);
    dispFooter.begin(         _winFooter.x, _winFooter.y, _winFooter.w, _winFooter.h);
    volBox.begin(             _winVolBox.x, _winVolBox.y, _winVolBox.w, _winVolBox.h);
    myList.begin(             _winWoHF.x,   _winWoHF.y,   _winWoHF.w,   _winWoHF.h, _fonts[0]);
    // RADIO -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    sdr_RA_volume.begin(      _sdrOvBtns.x,  _sdrOvBtns.y, _sdrOvBtns.w, _sdrOvBtns.h, 0, _volumeSteps); sdr_RA_volume.setValue(_cur_volume);
    btn_RA_mute.begin(    0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_mute.setOffPicturePath("/btn/Button_Mute_Off_Green.png");
                                                                                         btn_RA_mute.setOnPicturePath("/btn/Button_Mute_On_Red.png");
                                                                                         btn_RA_mute.setClickedOffPicturePath("/btn/Button_Mute_Off_Yellow.png");
                                                                                         btn_RA_mute.setClickedOnPicturePath("/btn/Button_Mute_On_Yellow.png");
                                                                                         btn_RA_mute.setValue(_f_mute);
    btn_RA_prevSta.begin( 1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_prevSta.setDefaultPicturePath("/btn/Button_Previous_Green.png");
                                                                                         btn_RA_prevSta.setClickedPicturePath("/btn/Button_Previous_Yellow.png");
    btn_RA_nextSta.begin( 2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_nextSta.setDefaultPicturePath("/btn/Button_Next_Green.png");
                                                                                         btn_RA_nextSta.setClickedPicturePath("/btn/Button_Next_Yellow.png");
    btn_RA_staList.begin( 0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_staList.setDefaultPicturePath("/btn/Button_List_Green.png");
                                                                                         btn_RA_staList.setClickedPicturePath("/btn/Button_List_Yellow.png");
                                                                                         btn_RA_staList.setAlternativePicturePath("/btn/Button_List_Magenta.png");
    btn_RA_player.begin(  1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_player.setDefaultPicturePath("/btn/Button_Player_Green.png");
                                                                                         btn_RA_player.setClickedPicturePath("/btn/Button_Player_Yellow.png");
                                                                                         btn_RA_player.setAlternativePicturePath("/btn/Button_Player_Magenta.png");
    btn_RA_dlna.begin(    2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_dlna.setDefaultPicturePath("/btn/Button_DLNA_Green.png");
                                                                                         btn_RA_dlna.setClickedPicturePath("/btn/Button_DLNA_Yellow.png");
                                                                                         btn_RA_dlna.setAlternativePicturePath("/btn/Button_DLNA_Magenta.png");
    btn_RA_clock.begin(   3 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_clock.setDefaultPicturePath("/btn/Button_Clock_Green.png");
                                                                                         btn_RA_clock.setClickedPicturePath("/btn/Button_Clock_Yellow.png");
                                                                                         btn_RA_clock.setAlternativePicturePath("/btn/Button_Clock_Magenta.png");
    btn_RA_sleep.begin(   4 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_sleep.setDefaultPicturePath("/btn/Button_OffTimer_Green.png");
                                                                                         btn_RA_sleep.setClickedPicturePath("/btn/Button_OffTimer_Yellow.png");
                                                                                         btn_RA_sleep.setAlternativePicturePath("/btn/Button_OffTimer_Magenta.png");
    btn_RA_settings.begin(5 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_settings.setDefaultPicturePath("/btn/Button_Settings_Green.png");
                                                                                         btn_RA_settings.setClickedPicturePath("/btn/Button_Settings_Yellow.png");
                                                                                         btn_RA_settings.setAlternativePicturePath("/btn/Button_Settings_Magenta.png");
    btn_RA_bt.begin(      6 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_bt.setDefaultPicturePath("/btn/Button_Bluetooth_Green.png");
                                                                                         btn_RA_bt.setClickedPicturePath("/btn/Button_Bluetooth_Yellow.png");
                                                                                         btn_RA_bt.setAlternativePicturePath("/btn/Button_Bluetooth_Magenta.png");
                                                                                         btn_RA_bt.setInactivePicturePath("/btn/Button_Bluetooth_Grey.png");
    btn_RA_off.begin(     7 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_RA_off.setDefaultPicturePath("/btn/Button_Off_Red.png");
                                                                                         btn_RA_off.setClickedPicturePath("/btn/Button_Off_Yellow.png");
                                                                                         btn_RA_off.setAlternativePicturePath("/btn/Button_Off_Magenta.png");
    txt_RA_sTitle.begin(      _winSTitle.x, _winSTitle.y, _winSTitle.w, _winSTitle.h);   txt_RA_sTitle.setFont(0); // 0 -> auto
    txt_RA_staName.begin(       _winName.x,   _winName.y,   _winName.w,   _winName.h);   txt_RA_staName.setFont(0); // 0 -> auto
    txt_RA_irNum.begin(         _winWoHF.x,   _winWoHF.y,   _winWoHF.w,   _winWoHF.h);   txt_RA_irNum.setTextColor(TFT_GOLD); txt_RA_irNum.setFont(_fonts[8]);
    pic_RA_logo.begin(          _winLogo.x,   _winLogo.y);
    VUmeter_RA.begin(        _winVUmeter.x,_winVUmeter.y,_winVUmeter.w,_winVUmeter.h);
    // STATIONSLIST ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    lst_RADIO.begin(          _winWoHF.x, _winWoHF.y, _winWoHF.w, _winWoHF.h, _fonts[0], &_cur_station);
    // PLAYER-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    btn_PL_mute.begin(    0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_mute.setOffPicturePath("/btn/Button_Mute_Off_Green.png");
                                                                                         btn_PL_mute.setOnPicturePath("/btn/Button_Mute_On_Red.png");
                                                                                         btn_PL_mute.setClickedOffPicturePath("/btn/Button_Mute_Off_Yellow.png");
                                                                                         btn_PL_mute.setClickedOnPicturePath("/btn/Button_Mute_On_Yellow.png");
                                                                                         btn_PL_mute.setAlternativeOffPicturePath("/btn/Button_Mute_Off_Magenta.png");
                                                                                         btn_PL_mute.setAlternativeOnPicturePath("/btn/Button_Mute_On_Magenta.png");
                                                                                         btn_PL_mute.setValue(_f_mute);
    btn_PL_pause.begin(   1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_pause.setOffPicturePath("/btn/Button_Pause_Blue.png");
                                                                                         btn_PL_pause.setOnPicturePath("/btn/Button_Play_Blue.png");
                                                                                         btn_PL_pause.setClickedOffPicturePath("/btn/Button_Pause_Yellow.png");
                                                                                         btn_PL_pause.setClickedOnPicturePath("/btn/Button_Play_Yellow.png");
                                                                                         btn_PL_pause.setAlternativeOffPicturePath("/btn/Button_Pause_Magenta.png");
                                                                                         btn_PL_pause.setAlternativeOnPicturePath("/btn/Button_Play_Magenta.png");
                                                                                         btn_PL_pause.setValue(false);
    btn_PL_cancel.begin(  2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_cancel.setDefaultPicturePath("/btn/Button_Cancel_Red.png");
                                                                                         btn_PL_cancel.setClickedPicturePath("/btn/Button_Cancel_Yellow.png");
                                                                                         btn_PL_cancel.setAlternativePicturePath("/btn/Button_Cancel_Magenta.png");
    sdr_PL_volume.begin(  5 * _winButton.w + 10, _winButton.y, _winButton.w * 3 - 10, _winButton.h, 0, _volumeSteps); sdr_PL_volume.setValue(_cur_volume);
    btn_PL_prevFile.begin(0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_prevFile.setDefaultPicturePath("/btn/Button_Left_Blue.png");
                                                                                         btn_PL_prevFile.setClickedPicturePath("/btn/Button_Left_Yellow.png");
                                                                                         btn_PL_prevFile.setAlternativePicturePath("/btn/Button_Left_Magenta.png");
    btn_PL_nextFile.begin(1 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_nextFile.setDefaultPicturePath("/btn/Button_Right_Blue.png");
                                                                                         btn_PL_nextFile.setClickedPicturePath("/btn/Button_Right_Yellow.png");
                                                                                         btn_PL_nextFile.setAlternativePicturePath("/btn/Button_Right_Magenta.png");
    btn_PL_ready.begin(   2 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_ready.setDefaultPicturePath("/btn/Button_Ready_Blue.png");
                                                                                         btn_PL_ready.setClickedPicturePath("/btn/Button_Ready_Yellow.png");
                                                                                         btn_PL_ready.setAlternativePicturePath("/btn/Button_Ready_Magenta.png");
    btn_PL_playAll.begin( 3 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_playAll.setDefaultPicturePath("/btn/Button_PlayAll_Blue.png");
                                                                                         btn_PL_playAll.setClickedPicturePath("/btn/Button_PlayAll_Yellow.png");
                                                                                         btn_PL_playAll.setAlternativePicturePath("/btn/Button_PlayAll_Magenta.png");
    btn_PL_shuffle.begin( 4 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_shuffle.setDefaultPicturePath("/btn/Button_Shuffle_Blue.png");
                                                                                         btn_PL_shuffle.setClickedPicturePath("/btn/Button_Shuffle_Yellow.png");
                                                                                         btn_PL_shuffle.setAlternativePicturePath("/btn/Button_Shuffle_Magenta.png");
    btn_PL_fileList.begin(5 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_fileList.setDefaultPicturePath("/btn/Button_List_Green.png");
                                                                                         btn_PL_fileList.setClickedPicturePath("/btn/Button_List_Yellow.png");
                                                                                         btn_PL_fileList.setAlternativePicturePath("/btn/Button_List_Magenta.png");
    btn_PL_radio.begin(   6 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_radio.setDefaultPicturePath("/btn/Button_Radio_Green.png");
                                                                                         btn_PL_radio.setClickedPicturePath("/btn/Button_Radio_Yellow.png");
                                                                                         btn_PL_radio.setAlternativePicturePath("/btn/Button_Radio_Magenta.png");
    btn_PL_off.begin(     7 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_off.setDefaultPicturePath("/btn/Button_Off_Red.png");
                                                                                         btn_PL_off.setClickedPicturePath("/btn/Button_Off_Yellow.png");
                                                                                         btn_PL_off.setAlternativePicturePath("/btn/Button_Off_Magenta.png");
    btn_PL_playPrev.begin(3 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_playPrev.setDefaultPicturePath("/btn/Button_Previous_Blue.png");
                                                                                         btn_PL_playPrev.setClickedPicturePath("/btn/Button_Previous_Yellow.png");
                                                                                         btn_PL_playPrev.setAlternativePicturePath("/btn/Button_Previous_Magenta.png");
    btn_PL_playNext.begin(4 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);   btn_PL_playNext.setDefaultPicturePath("/btn/Button_Next_Blue.png");
                                                                                         btn_PL_playNext.setClickedPicturePath("/btn/Button_Next_Yellow.png");
                                                                                         btn_PL_playNext.setAlternativePicturePath("/btn/Button_Next_Magenta.png");

