schreibfaul1/ESP32-MiniWebRadio/src/main.cpp
                                                                                         btn_BT_power.setValue(_f_BTpower);
                                                                                         pic_BT_mode.setPicturePath("/common/BTnc.png");
    pic_BT_mode.begin(        _winLogo.x,   _winLogo.y);                                 pic_BT_mode.setAlternativPicturePath("/common/BTnc.png");
    txt_BT_volume.begin(      _winFileNr.x, _winFileNr.y, _winFileNr.w, _winFileNr.h);   txt_BT_volume.setFont(_fonts[2]);
    txt_BT_mode.begin(        _winName.x,   _winName.y,   _winName.w,   _winName.h);     txt_BT_mode.setFont(_fonts[5]);
    // IR_SETTINGS -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
    btn_IR_radio.begin( 0 * _winButton.w, _winButton.y, _winButton.w, _winButton.h);     btn_IR_radio.setDefaultPicturePath("/btn/Button_Radio_Green.png");
                                                                                         btn_IR_radio.setClickedPicturePath("/btn/Button_Radio_Yellow.png");
}
// clang-format off

/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                              C H A N G E    S T A T E                                                                       ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

// clang-format on
void changeState(int32_t state){
    disableAllObjects();
    _f_volBarVisible = false;
    if(_timeCounter.timer){setTimeCounter(0);}
    dispFooter.enable();
    dispHeader.enable();
    dispHeader.updateItem(_hl_item[state]);
    if(state != RADIO) {dispFooter.updateFlag(NULL);}
    switch(state) {
        case RADIO:{
            if(_state != RADIO) clearWithOutHeaderFooter();
            txt_RA_staName.enable();
            pic_RA_logo.enable();
            if(_radioSubMenue == 0){
                if(_f_irResultSeen){txt_RA_irNum.hide(); setStationByNumber(_irResult); _f_irResultSeen = false;} // ir_number, valid between 1 ... 999
                if(_state != RADIO) {showLogoAndStationName(true);}
                setTimeCounter(0);
                VUmeter_RA.show();
                txt_RA_sTitle.setText("");
                txt_RA_sTitle.show();
                _f_newStreamTitle = true;
            }
            if(_radioSubMenue == 1){ // Mute, Vol+, Vol-, Sta+, Sta-, StaList
                clearTitle();
                txt_RA_sTitle.disable();
                sdr_RA_volume.show();
                btn_RA_mute.show();
                btn_RA_prevSta.show();   btn_RA_nextSta.show();
            //    txt_RA_staName.show();
                setTimeCounter(2);
            }
            if(_radioSubMenue == 2){ // Player, DLNA, Clock, SleepTime, Brightness, EQ, BT, Off
                sdr_RA_volume.hide();
                btn_RA_staList.show();
                btn_RA_player.show();    btn_RA_dlna.show();  btn_RA_clock.show();
                btn_RA_sleep.show(); btn_RA_settings.show();
                btn_RA_bt.show(!_f_BtEmitterFound); btn_RA_off.show();
                setTimeCounter(2);
            }
            if(_radioSubMenue == 3){ // show Numbers from IR
                char buf[10];
                itoa(_irNumber, buf, 10);
                txt_RA_irNum.setText(buf, TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
                txt_RA_irNum.show();
                setTimeCounter(1);
            }
            if(_radioSubMenue == 4){ // IR select mode
                clearTitle();
                txt_RA_sTitle.disable();
                btn_RA_staList.showAlternativePic();
                btn_RA_player.show();
                btn_RA_dlna.show();
                btn_RA_clock.show();
                btn_RA_sleep.show();
                btn_RA_settings.show();
                btn_RA_bt.show(!_f_BtEmitterFound);
                btn_RA_off.show();
                setTimeCounter(2);
            }
            if(_state != RADIO) webSrv.send("changeState=", "RADIO");
            break;
        }

        case STATIONSLIST:{
            clearWithOutHeaderFooter();
            lst_RADIO.show();
            setTimeCounter(4);
            break;
        }

        case PLAYER: {
            if(_state != PLAYER) clearWithOutHeaderFooter();
            pic_PL_logo.enable();
            if(_playerSubMenue == 0){ // prev, next, ready, play_all, shuffle, list, radio, off
                if(!_cur_AudioFolder) {x_ps_free(&_cur_AudioFolder); _cur_AudioFolder = strdup("/audiofiles/");}
                _SD_content.listFilesInDir(_cur_AudioFolder, true, false);
                _cur_Codec = 0;
                showFileLogo(PLAYER);
                showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); txt_PL_fName.show();
                pgb_PL_progress.hide();
                if(_state != PLAYER) webSrv.send("changeState=", "PLAYER");
                txt_PL_fNumber.show();
                showAudioFileNumber();
                btn_PL_prevFile.show(); btn_PL_nextFile.show(); btn_PL_ready.show(); btn_PL_playAll.show(); btn_PL_shuffle.show(); btn_PL_fileList.show(); btn_PL_radio.show(); btn_PL_off.show();
            }
            if(_playerSubMenue == 1){
                btn_PL_fileList.hide();
                btn_PL_radio.hide();
                btn_PL_off.hide();
                pgb_PL_progress.setValue(0); pgb_PL_progress.show();
                sdr_PL_volume.show();
                showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); txt_PL_fName.show();
                txt_PL_fNumber.show();
                btn_PL_mute.show();
                btn_PL_pause.setOff(); btn_PL_pause.show();
                btn_PL_cancel.show(); btn_PL_playPrev.show(); btn_PL_playNext.show();
            }
            if(_playerSubMenue == 2){ // same as submenue 0 for IR
                if(!_cur_AudioFolder) {_cur_AudioFolder = strdup("/audiofiles/"); _cur_AudioFileNr = 0;}
                _SD_content.listFilesInDir(_cur_AudioFolder, true, false);
                _cur_Codec = 0;
                showFileLogo(PLAYER);
                showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); txt_PL_fName.show();
                pgb_PL_progress.hide();
                if(_state != PLAYER) webSrv.send("changeState=", "PLAYER");
                txt_PL_fNumber.show();
                showAudioFileNumber();
                btn_PL_prevFile.showAlternativePic(); btn_PL_nextFile.show(); btn_PL_ready.show(); btn_PL_playAll.show(); btn_PL_shuffle.show(); btn_PL_fileList.show(); btn_PL_radio.show(); btn_PL_off.show();
            }
            if(_playerSubMenue == 3){ // same as submenue 1 for IR
                btn_PL_fileList.hide();
                btn_PL_radio.hide();
                btn_PL_off.hide();
                pgb_PL_progress.setValue(0); pgb_PL_progress.show();
                sdr_PL_volume.show();
                showFileName(_SD_content.getColouredSStringByIndex(_cur_AudioFileNr)); txt_PL_fName.show();
                txt_PL_fNumber.show();
                btn_PL_mute.showAlternativePic();
                btn_PL_pause.setOff(); btn_PL_pause.show();
                btn_PL_cancel.show(); btn_PL_playPrev.show(); btn_PL_playNext.show();
            }
            break;
        }
        case AUDIOFILESLIST: {
            clearWithOutHeaderFooter();
            lst_PLAYER.show(_cur_AudioFolder, _cur_AudioFileNr);
            setTimeCounter(4);
            break;
        }
        case DLNA:{
            if(_state != DLNA){
                if(_state != DLNAITEMSLIST) audio.stopSong();
                clearWithOutHeaderFooter();
                pic_DL_logo.enable();
                pgb_DL_progress.setValue(0);
                pgb_DL_progress.show();
                txt_DL_fName.show();
                showFileLogo(DLNA);
            }
            if(_dlnaSubMenue == 0){ // TP submenu
                if(audio.isRunning()) btn_DL_pause.setActive(true);
                else                  btn_DL_pause.setActive(false);
                btn_DL_pause.show(); sdr_DL_volume.show(); btn_DL_mute.show(); btn_DL_cancel.show(); btn_DL_fileList.show(); btn_DL_radio.show();
            }
            if(_dlnaSubMenue == 1){ // IR submenu
                if(audio.isRunning()) btn_DL_pause.setActive(true);
                else                  btn_DL_pause.setActive(false);
                btn_DL_pause.show(); sdr_DL_volume.show(); btn_DL_mute.showAlternativePic(); btn_DL_cancel.show(); btn_DL_fileList.show(); btn_DL_radio.show();
            }
            if(_state != DLNA) webSrv.send("changeState=", "DLNA");
            break;
        }
        case DLNAITEMSLIST:{
            lst_DLNA.show(_currDLNAsrvNr, dlna.getServer(), dlna.getBrowseResult(), &_dlnaLevel, _dlnaMaxItems);
            setTimeCounter(4);
            break;
        }
        case CLOCK:{
            if(_state != CLOCK) {bgColorWithOutHeaderFooter();}
            clk_CL_green.show();
            if(_clockSubMenue == 0){
                btn_CL_mute.hide(); btn_CL_alarm.hide(); btn_CL_radio.hide(); sdr_CL_volume.hide(); btn_CL_off.hide();
            }
            if(_clockSubMenue == 1){
                setTimeCounter(2);
                btn_CL_mute.show();     btn_CL_alarm.show();    btn_CL_radio.show(); sdr_CL_volume.show(); btn_CL_off.show();
            }
            if(_clockSubMenue == 2){ // same as _clockSubMenue 1 for IR
                setTimeCounter(2);
                btn_CL_alarm.showAlternativePic(); btn_CL_radio.show(); btn_CL_mute.show(); btn_CL_off.show(); sdr_CL_volume.show();
            }
            break;
        }
        case ALARM:{
            if(_state != ALARM) bgColorWithOutHeaderFooter();
            if(_alarmSubMenue == 0){
                btn_AL_left.show(); btn_AL_right.show(); btn_AL_up.show(); btn_AL_down.show(); btn_AL_ready.show();
                clk_AL_red.show();
            }
            if(_alarmSubMenue == 1){ // same as _alarmSubMenue fot IR
                setTimeCounter(2);
                btn_AL_left.showAlternativePic(); btn_AL_right.show(); btn_AL_up.show(); btn_AL_down.show(); btn_AL_ready.show();
                clk_AL_red.show();
            }
            break;
        }
        case SLEEPTIMER:{
            if(_state != SLEEPTIMER) {
                clearWithOutHeaderFooter(); display_sleeptime();
                if(TFT_CONTROLLER < 2) drawImage("/common/Night_Gown.bmp", 198, 23);
                else                   drawImage("/common/Night_Gown.bmp", 280, 45);
            }
            if(_sleepTimerSubMenue == 0){
                btn_SL_up.show(); btn_SL_down.show(); btn_SL_ready.show(); btn_SL_cancel.show();
            }
            if(_sleepTimerSubMenue == 1){
                btn_SL_up.showAlternativePic(); btn_SL_down.show(); btn_SL_ready.show(); btn_SL_cancel.show();
            }
            break;
        }
        case SETTINGS:{
            if(_state != SETTINGS){
                clearWithOutHeaderFooter();
                showFileLogo(SETTINGS);
            }
            if(_settingsSubMenue == 0){
                btn_SE_bright.show(!_f_brightnessIsChangeable); btn_SE_equal.show(); btn_SE_radio.show();
            }
            if(_settingsSubMenue == 1){
                btn_SE_bright.showAlternativePic(!_f_brightnessIsChangeable); btn_SE_equal.show(); btn_SE_radio.show();
            }
            break;
        }
        case BRIGHTNESS:{
            if(_state != BRIGHTNESS) {clearWithOutHeaderFooter(); pic_BR_logo.show();}
            sdr_BR_value.show();
            txt_BR_value.setText(int2str(_brightness), TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
            txt_BR_value.show();
            if(_brightnessSubMenue == 0){
                btn_BR_ready.show();
            }
            if(_brightnessSubMenue == 1){ // same as _brightnessSubMenue for IR
                btn_BR_ready.showAlternativePic();
            }
            break;
        }
        case EQUALIZER:
            if(_state != EQUALIZER) clearWithOutHeaderFooter();
            sdr_EQ_lowPass.show(); sdr_EQ_bandPass.show(); sdr_EQ_highPass.show(); sdr_EQ_balance.show();
            btn_EQ_lowPass.show(); btn_EQ_bandPass.show(); btn_EQ_highPass.show(); btn_EQ_balance.show(); btn_EQ_Player.show(); btn_EQ_mute.show();
            txt_EQ_lowPass.show(); txt_EQ_bandPass.show(); txt_EQ_highPass.show(); txt_EQ_balance.show();
            if(_equalizerSubMenue == 0){
                btn_EQ_Radio.show();
            }
            if(_equalizerSubMenue == 1){
                btn_EQ_Radio.showAlternativePic();
            }

            break;

        case BLUETOOTH: {
            clearWithOutHeaderFooter();
            btn_BT_volUp.show(); btn_BT_volDown.show(); btn_BT_pause.show(); btn_BT_mode.show(); btn_BT_radio.show(); btn_BT_power.show(); pic_BT_mode.show();
            char* mode = strdup(bt_emitter.getMode());
            if(strcmp(mode, "RX") == 0){
                txt_BT_mode.writeText("RECEIVER", TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
                if(bt_emitter.isConnected()) muteChanged(true);
            }
            else {
                txt_BT_mode.writeText("EMITTER", TFT_ALIGN_CENTER, TFT_ALIGN_CENTER);
            }
            txt_BT_mode.setBGcolor(TFT_BROWN); txt_BT_mode.show();
            char c[10]; sprintf(c, "Vol: %02i", bt_emitter.getVolume()); txt_BT_volume.writeText(c, TFT_ALIGN_CENTER, TFT_ALIGN_CENTER); txt_BT_volume.show();
            if(_state != BLUETOOTH) webSrv.send("changeState=", "BLUETOOTH");
            x_ps_free(&mode);
            break;
        }
        case IR_SETTINGS:
            clearWithOutHeaderFooter();
            btn_IR_radio.show();
            break;
    }
    _state = state;
}
// clang-format on

/*         ╔═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╗
           ║                                                                                    L O O P                                                                                  ║
           ╚═════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╝   */

void loop() {
    if(!_f_ESPfound)    {vTaskDelay(10);return;}    // Guard:  wrong chip?
    if(!_f_SD_MMCfound) {vTaskDelay(10); return;}   // Guard:  SD_MMC could not be initialisized
    vTaskDelay(1);
    audio.loop();
    webSrv.loop();
    ir.loop();
    tp.loop();
    ftpSrv.handleFTP();
    ArduinoOTA.handle();
    dlna.loop();
    bt_emitter.loop();

    if(_f_dlnaBrowseServer) {_f_dlnaBrowseServer = false; dlna.browseServer(_currDLNAsrvNr, _dlnaHistory[_dlnaLevel].objId, _totalNumberReturned);}
    if(_f_clearLogo)        {_f_clearLogo = false; clearLogo();}
    if(_f_clearStationName) { _f_clearStationName = false; clearStationName();}

    if(_f_playlistEnabled) {
        if(!_f_playlistNextFile) {
            if(!audio.isRunning() && !_f_pauseResume) {
                SerialPrintfln("AUDIO_info:  " ANSI_ESC_GREEN "next playlist file");
                processPlaylist(false);
                _playlistTime = millis();
                _f_playlistNextFile = true;
            }
        }
        else {
            if(_playlistTime + 5000 < millis()) _f_playlistNextFile = false;
        }
    }
    //-----------------------------------------------------0.1 SEC------------------------------------------------------------------------------------
    if(_f_100ms) { // calls every 0.1 second
        _f_100ms = false;

        if(_state == RADIO && _radioSubMenue == 0) VUmeter_RA.update(audio.getVUlevel());

        static uint8_t factor = 0;
        static bool f_tc = false;
        if(factor > 0){
            factor --;
        }
        else{
            if(_timeCounter.timer > 0){
                factor = _timeCounter.factor;
                dispFooter.updateTC(_timeCounter.timer);
                _timeCounter.timer --;
                f_tc = true;
            }
            else{
                if(f_tc){
                    f_tc = false;
                    dispFooter.updateTC(0);
                    if(_f_sleeping) return; // tc is active by pressing a button, but do nothing if "off"

